tap "dbt-labs/dbt"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "weaveworks/tap"
brew "act"
brew "aws-iam-authenticator"
brew "gh"
brew "git"
brew "glib"
brew "irssi"
brew "jq"
brew "maven"
brew "node"
brew "nvm"
brew "openssl@3"
brew "telnet"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "weaveworks/tap/eksctl"
cask "anaconda"
cask "db-browser-for-sqlite"
