tap "coder/coder"
tap "homebrew/bundle"
tap "jeffreywildman/virt-manager"
tap "restatedev/tap"
brew "ansible"
brew "glib"
brew "at-spi2-core"
brew "cairo"
brew "cilium-cli"
brew "cmake"
brew "etcd"
brew "harfbuzz"
brew "python@3.12"
brew "tesseract"
brew "ffmpeg@6"
brew "gh"
brew "git"
brew "gsettings-desktop-schemas"
brew "pkgconf"
brew "gobject-introspection"
brew "gtk4"
brew "json-glib"
brew "libsoup"
brew "py3cairo"
brew "pygobject3"
brew "gstreamer"
brew "helm"
brew "htop"
brew "iperf3"
brew "k9s"
brew "libvirt"
brew "macvim"
brew "meson"
brew "minikube"
brew "node"
brew "openssh"
brew "opentofu"
brew "pnpm"
brew "postgresql@14"
brew "protobuf"
brew "telnet"
brew "wireguard-tools"
brew "zsh"
brew "coder/coder/coder"
brew "jeffreywildman/virt-manager/virt-viewer"
brew "restatedev/tap/restate"
brew "restatedev/tap/restate-server"
cask "font-hack-nerd-font"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "belkacemberras.spellcheck"
vscode "bierner.markdown-mermaid"
vscode "coder.coder-remote"
vscode "cschlosser.doxdocgen"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "kevinrose.vsc-python-indent"
vscode "matangover.mypy"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "quarto.quarto"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "tim-koehler.helm-intellisense"
vscode "twxs.cmake"
vscode "uctakeoff.vscode-counter"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
